Autodesk.Revit.DB.ElementStructuralTypeFilter.StructuralType
The structural type.
Since:
2011

Autodesk.Revit.DB.ElementStructuralTypeFilter.#ctor(Autodesk.Revit.DB.Structure.StructuralType,System.Boolean)
Constructs a new instance of a filter to match elements by structural type, with the option to match all elements which are of the given structural type.
structuralType:
The structural type to match.
inverted:
True if the filter should match all elements which are not of the given structural type.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.ElementStructuralTypeFilter.#ctor(Autodesk.Revit.DB.Structure.StructuralType)
Constructs a new instance of a filter to match elements by structural type.
structuralType:
The structural type to match.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.ElementStructuralTypeFilter
A filter used to find elements matching a structural type.
Remarks:
This filter is a quick filter.
Quick filters operate only on the ElementRecord, a low-memory class which has
a limited interface to read element properties. Elements which are rejected
by a quick filter will not be expanded in memory.
Since:
2011